<a href="https://colab.research.google.com/github/jshrma14/Google_colab_python/blob/main/Case_study_1_module_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Importing libraries....

import numpy as np
import pandas as pd

In [2]:
dssscore1 = pd.read_csv("DSScoreTerm1.csv") # reading dataset1

In [3]:
dssscore1.head()

             Name  Score  Age         Ethinicity        Subject Sex  ID
0  AI-KYUNG CHUNG   82.0   18     White American  Data Structue   M   1
1     ALAN HARVEY   79.0   19  European American  Data Structue   M   2
2    ALAN REYNAUD   39.0   19  European American  Data Structue   M   3
3  ALBERT CENDANA   76.0   18     White American  Data Structue   M   4
4  ALBERT HOLT JR   76.0   18     White American  Data Structue   F   5

In [4]:
mathscore1 = pd.read_csv("MathScoreTerm1.csv") # reading dataset2
mathscore1.head()

             Name  Score  Age         Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18     White American   Maths   M   1
1     ALAN HARVEY   85.0   19  European American   Maths   M   2
2    ALAN REYNAUD   45.0   19  European American   Maths   M   3
3  ALBERT CENDANA   82.0   18     White American   Maths   M   4
4  ALBERT HOLT JR   82.0   18     White American   Maths   F   5

In [87]:
physcore1 = pd.read_csv("PhysicsScoreTerm1.csv") # reading dataset3
physcore1.head()

             Name  Score  Age         Ethinicity  Subject Sex  ID
0  AI-KYUNG CHUNG   84.0   18     White American  Physics   M   1
1     ALAN HARVEY   81.0   19  European American  Physics   M   2
2    ALAN REYNAUD   41.0   19  European American  Physics   M   3
3  ALBERT CENDANA   78.0   18     White American  Physics   M   4
4  ALBERT HOLT JR   78.0   18     White American  Physics   F   5

In [88]:
# Dropping Name and ethinicity col...

dssnew = dssscore1.drop(['Name','Ethinicity'], axis = 1)
phynew = physcore1.drop(['Name','Ethinicity'], axis = 1)
mathnew = mathscore1.drop(['Name','Ethinicity'], axis = 1)

In [9]:
dssnew.head()

   Score  Age        Subject Sex  ID
0   82.0   18  Data Structue   M   1
1   79.0   19  Data Structue   M   2
2   39.0   19  Data Structue   M   3
3   76.0   18  Data Structue   M   4
4   76.0   18  Data Structue   F   5

In [22]:
dssnew.isnull().sum(axis = 0)

Score      8
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [10]:
phynew.head()

   Score  Age  Subject Sex  ID
0   84.0   18  Physics   M   1
1   81.0   19  Physics   M   2
2   41.0   19  Physics   M   3
3   78.0   18  Physics   M   4
4   78.0   18  Physics   F   5

In [89]:
phynew.isnull().sum(axis = 0)

Score      6
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [19]:
mathnew.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [20]:
mathnew.isnull().sum(axis = 0)

Score      3
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [93]:
# Filling null Score by 0


print("Physics")
phynew['Score'].fillna(0, inplace=True)
print(phynew.isnull().sum())

print("DSS")
dssnew['Score'].fillna(0, inplace=True)
print(dssnew.isnull().sum())

print("Maths")
mathnew['Score'].fillna(0, inplace=True)
print(mathnew.isnull().sum())

Physics
Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64
DSS
Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64
Maths
Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [94]:
# Replacing M and F with 1 and 2

phynew.replace('M',1, inplace=True)
phynew.replace('F',2, inplace=True)
dssnew.replace('M',1, inplace=True)
dssnew.replace('F',1, inplace=True)
mathnew.replace('M',1, inplace=True)
mathnew.replace('F',1, inplace=True)

In [95]:
phynew.head()

   Score  Age  Subject  Sex  ID
0   84.0   18  Physics    1   1
1   81.0   19  Physics    1   2
2   41.0   19  Physics    1   3
3   78.0   18  Physics    1   4
4   78.0   18  Physics    2   5

In [96]:
# Merging data for final data set...

n1 = pd.merge(mathnew, phynew, on="ID")

final = pd.merge(n1, dssnew, on="ID")

In [97]:
print(final)

     Score_x  Age_x Subject_x  Sex_x  ...  Score  Age        Subject Sex
0       88.0     18     Maths      1  ...   82.0   18  Data Structue   1
1       85.0     19     Maths      1  ...   79.0   19  Data Structue   1
2       45.0     19     Maths      1  ...   39.0   19  Data Structue   1
3       82.0     18     Maths      1  ...   76.0   18  Data Structue   1
4       82.0     18     Maths      1  ...   76.0   18  Data Structue   1
..       ...    ...       ...    ...  ...    ...  ...            ...  ..
594     45.0     19     Maths      1  ...   39.0   19  Data Structue   1
595     75.0     18     Maths      1  ...   69.0   18  Data Structue   1
596     53.0     20     Maths      1  ...   47.0   20  Data Structue   1
597     75.0     20     Maths      1  ...   69.0   20  Data Structue   1
598     88.0     19     Maths      1  ...    0.0   19  Data Structue   1

[599 rows x 13 columns]